## Data Frames

![image](images/DataFrame.PNG)

![image](images/DataFrameslogo.png)

In [3]:
# Creating a dataframe using List
# import pandas as pd
import pandas as pd
 
# list of strings
lst = ['Python', 'For', 'Data Science', 'and ', 
            'portal', 'for', 'www.pandas.org']
 
# Calling DataFrame constructor on list
df = pd.DataFrame(lst)
print(df)

                0
0          Python
1             For
2    Data Science
3            and
4          portal
5             for
6  www.pandas.org

#### Creating DataFrame from dict of ndarray/lists:

In [4]:
# Python code demonstrate creating 
# DataFrame from dict narray / lists 
# By default addresses.
 
import pandas as pd
 
# intialise data of lists.
data = {'Name':['Tom', 'nick', 'krish', 'jack'],
        'Age':[20, 21, 19, 18]}
 
# Create DataFrame
df = pd.DataFrame(data)
 
# Print the output.
print(df)

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [6]:
print(df['Age'][0:1])

0    20
Name: Age, dtype: int64

#### Creating a Pandas DataFrame
Dealing with Rows and Columns

A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. 

We can perform basic operations on rows/columns like 
1. selecting, 
2. deleting, 
3. adding, and 
4. renaming.

#### Column Selection: 
In Order to select a column in Pandas DataFrame, we can either access the columns by calling them by their columns name.

In [9]:

# Import pandas package
import pandas as pd
 
# Define a dictionary containing employee data
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
 
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data)
 
# select two columns
print(df[['Name', 'Qualification']],'\n')
print(df),

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

(None,)

##### Row Selection: 
    Pandas provide a unique method to retrieve rows from a Data frame. 
    1. DataFrame.loc[] method is used to retrieve rows from Pandas DataFrame. 
    2. Rows can also be selected by passing integer location to an iloc[] function.

In [26]:
# importing pandas package
import pandas as pd
 
# making data frame from csv file
data = pd.read_csv("Data/nba.csv", index_col ="Name")
df = pd.DataFrame(data)
 
# retrieving row by loc method
first = df.loc["Avery Bradley"]
second = df.loc["R.J. Hunter"]

print(first, "\n\n\n", second)

Team        Boston Celtics
Number                   0
Position                PG
Age                     25
Height              06-Feb
Weight                 180
College              Texas
Salary         7.45235e+06
Name: Avery Bradley, dtype: object


 Team        Boston Celtics
Number                  28
Position                SG
Age                     22
Height              06-May
Weight                 185
College      Georgia State
Salary         1.14864e+06
Name: R.J. Hunter, dtype: object

In [6]:
print(data.info(),data.describe(),data.head(),data.tail())

<class 'pandas.core.frame.DataFrame'>
Index: 457 entries, Avery Bradley to Jeff Withey
Data columns (total 8 columns):
Team        457 non-null object
Number      457 non-null int64
Position    457 non-null object
Age         457 non-null int64
Height      457 non-null object
Weight      457 non-null int64
College     373 non-null object
Salary      446 non-null float64
dtypes: float64(1), int64(3), object(4)
memory usage: 52.1+ KB
None            Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842061e+06
std     15.966090    4.404016   26.368343  5.228909e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07                          Team  Number Position  Age  Height  Weight  \
Name
Avery Bradley  Boston Celtics       0       PG   25  06-Feb     180
Jae Crowder    Boston Celtics      99       SF   25  06-Jun     235
John Holland   Boston Celtics      30       SG   27  06-May     205
R.J. Hunter    Boston Celtics      28       SG   22  06-May     185
Jonas Jerebko  Boston Celtics       8       PF   29  06-Oct     231

                         College     Salary
Name
Avery Bradley              Texas  7452353.0
Jae Crowder            Marquette  6796117.0
John Holland   Boston University        NaN
R.J. Hunter        Georgia State  1148640.0
Jonas Jerebko                NaN  5000000.0                      Team  Number Position  Age  Height  Weight   College  \
Name
Trey Lyles    Utah Jazz      41       PF   20  06-Oct     234  Kentucky
Shelvin Mack  Utah Jazz       8       PG   26  06-Mar     203    Butler
Raul Neto     Utah Jazz      25       PG   24  06-Jan     179       NaN
Tibor Pleiss  Utah Jazz      21        C   26  07-Mar     256       NaN
Jeff Withey   Utah Jazz      24        C   26     7-0     231    Kansas

                 Salary
Name
Trey Lyles    2239800.0
Shelvin Mack  2433333.0
Raul Neto      900000.0
Tibor Pleiss  2900000.0
Jeff Withey    947276.0

In [17]:
df['Salary'].value_counts()

947276.0      31
845059.0      18
525093.0      13
981348.0       6
16407500.0     5
1100602.0      5
4000000.0      5
5000000.0      5
8000000.0      5
12000000.0     5
3000000.0      4
1000000.0      4
19689000.0     4
2814000.0      4
7000000.0      4
200600.0       3
1015421.0      3
2500000.0      3
13500000.0     3
8500000.0      3
2854940.0      3
5543725.0      3
2170465.0      2
11235955.0     2
55722.0        2
1270964.0      2
1140240.0      2
5500000.0      2
1842000.0      2
3425510.0      2
              ..
1474440.0      1
19688000.0     1
7900000.0      1
12250000.0     1
2841960.0      1
9463484.0      1
1404600.0      1
1584480.0      1
273038.0       1
9213483.0      1
3272091.0      1
1155600.0      1
6060606.0      1
3075880.0      1
2250000.0      1
4626960.0      1
1304520.0      1
12100000.0     1
7500000.0      1
295327.0       1
2836186.0      1
6486486.0      1
5016000.0      1
3333333.0      1
1824360.0      1
8042895.0      1
1242720.0      1
2489530.0      1
5103120.0      1
700902.0       1
Name: Salary, Length: 309, dtype: int64

In [11]:
# Selecting a single columns retrieving columns by indexing operator
first = data["Age"]
print(first)

Name
Avery Bradley              25
Jae Crowder                25
John Holland               27
R.J. Hunter                22
Jonas Jerebko              29
Amir Johnson               29
Jordan Mickey              21
Kelly Olynyk               25
Terry Rozier               22
Marcus Smart               22
Jared Sullinger            24
Isaiah Thomas              27
Evan Turner                27
James Young                20
Tyler Zeller               26
Bojan Bogdanovic           27
Markel Brown               24
Wayne Ellington            28
Rondae Hollis-Jefferson    21
Jarrett Jack               32
Sergey Karasev             22
Sean Kilpatrick            26
Shane Larkin               23
Brook Lopez                28
Chris McCullough           21
Willie Reed                26
Thomas Robinson            25
Henry Sims                 26
Donald Sloan               28
Thaddeus Young             27
                           ..
Cliff Alexander            20
Al-Farouq Aminu            25
Pat Connaughton            23
Allen Crabbe               24
Ed Davis                   27
Maurice Harkless           23
Gerald Henderson           28
Chris Kaman                34
Meyers Leonard             24
Damian Lillard             25
C.J. McCollum              24
Luis Montero               23
Mason Plumlee              26
Brian Roberts              30
Noah Vonleh                20
Trevor Booker              28
Trey Burke                 23
Alec Burks                 24
Dante Exum                 20
Derrick Favors             24
Rudy Gobert                23
Gordon Hayward             26
Rodney Hood                23
Joe Ingles                 28
Chris Johnson              26
Trey Lyles                 20
Shelvin Mack               26
Raul Neto                  24
Tibor Pleiss               26
Jeff Withey                26
Name: Age, Length: 457, dtype: int64

In [12]:
# Selecting a single row Indexing a DataFrame using .loc[ ] :

# retrieving row by loc method
first = data.loc["Avery Bradley"]
second = data.loc["R.J. Hunter"]
print(first,"\n\n\n",second )

Team        Boston Celtics
Number                   0
Position                PG
Age                     25
Height              06-Feb
Weight                 180
College              Texas
Salary         7.45235e+06
Name: Avery Bradley, dtype: object


 Team        Boston Celtics
Number                  28
Position                SG
Age                     22
Height              06-May
Weight                 185
College      Georgia State
Salary         1.14864e+06
Name: R.J. Hunter, dtype: object

#### Indexing a DataFrame using .iloc[ ] :

In order to select a single row using .iloc[], we can pass a single integer to .iloc[] function

In [13]:
# retrieving rows by iloc method 
row2 = data.iloc[3] 
print(row2)

Team        Boston Celtics
Number                  28
Position                SG
Age                     22
Height              06-May
Weight                 185
College      Georgia State
Salary         1.14864e+06
Name: R.J. Hunter, dtype: object

#### Working with Missing Data
Checking for missing values using 
1. isnull() and 
2. notnull()

In order to check missing values in Pandas DataFrame, we use a function isnull() and notnull(). Both function help in checking whether a value is NaN or not. These function can also be used in Pandas Series in order to find null values in a series.

In [27]:
import numpy as np
import pandas as pd
# dictionary of lists
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}
 
# creating a dataframe from list
df = pd.DataFrame(dict)
 
# using isnull() function  
df.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

**Filling missing values using fillna(), replace() and interpolate() :**

In order to fill null values in a datasets, we use 
1. fillna(), 
2. replace() and 
function these function replace NaN values with some value of their own. All these function help in filling a null values in datasets of a DataFrame.
3. interpolate(): 
Interpolate() function is basically used to fill NA values in the dataframe but it uses various interpolation technique to fill the missing values rather than hard-coding the value.

In [19]:
# importing pandas as pd
import pandas as pd
 
# importing numpy as np
import numpy as np
 
# dictionary of lists
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}
 
# creating a dataframe from dictionary
df = pd.DataFrame(dict)
 
# filling missing value using fillna()  
df.fillna(0)

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

**Dropping missing values using dropna() :**

In order to drop a null values from a dataframe, we used dropna() function this fuction drop Rows/Columns of datasets with Null values in different ways.

In [21]:
#Now we drop rows with at least one Nan value (Null value)
# importing pandas as pd
import pandas as pd
 
# importing numpy as np
import numpy as np
 
# dictionary of lists
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score':[52, 40, 80, 98],
        'Fourth Score':[np.nan, np.nan, np.nan, 65]}
 
# creating a dataframe from dictionary
df = pd.DataFrame(dict)
 
# using dropna() function  
df.dropna()

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

**Iterating over rows and columns**

***Iterating over rows :***
In order to iterate over rows, we can use three function 
1. iteritems(), 
2. iterrows(), 
3. itertuples() . These three function will help in iteration over rows.

In [22]:
# importing pandas as pd
import pandas as pd
  
# dictionary of lists
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
 
# creating a dataframe from a dictionary 
df = pd.DataFrame(dict)
 
print(df)

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

**Iterating over Columns**

In [23]:
# importing pandas as pd
import pandas as pd
   
# dictionary of lists
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
  
# creating a dataframe from a dictionary 
df = pd.DataFrame(dict)
df

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

#### DataFrame Methods:

| Method  | Description   |
|------|------|
|index()	|Method returns index (row labels) of the DataFrame|
|insert()|Method inserts a column into a DataFrame|
|add()|Method returns addition of dataframe and other, element-wise (binary operator add)|
|sub()|Method returns subtraction of dataframe and other, element-wise (binary operator sub)|
|mul()|Method returns multiplication of dataframe and other, element-wise (binary operator mul)|
|div()|Method returns floating division of dataframe and other, element-wise (binary operator truediv)|
|unique()|	Method extracts the unique values in the dataframe|
|nunique()|Method returns count of the unique values in the dataframe|
|value_counts()|	Method counts the number of times each unique value occurs within the Series
|columns()|	Method returns the column labels of the DataFrame
|axes()	|Method returns a list representing the axes of the DataFrame
|isnull()|Method creates a Boolean Series for extracting rows with null values
|notnull()|Method creates a Boolean Series for extracting rows with non-null values
|between()	|Method extracts rows where a column value falls in between a predefined range
|isin()|Method extracts rows from a DataFrame where a column value exists in a predefined collection
|dtypes()|	Method returns a Series with the data type of each column. The result’s index is the original DataFrame’s columns
|astype()|Method converts the data types in a Series
|values()|	Method returns a Numpy representation of the DataFrame i.e. only the values in the DataFrame will be returned, the axes labels will be removed
|sort_values()|- Set1, Set2Method sorts a data frame in Ascending or Descending order of passed Column
|sort_index()|Method sorts the values in a DataFrame based on their index positions or labels instead of their values but sometimes a data frame is made out of two or more data frames and hence later index can be changed using this method|
|loc[]|Method retrieves rows based on index label|
|iloc[]|Method retrieves rows based on index position|
|ix[]|Method retrieves DataFrame rows based on either index label or index position. This method combines the best features of the .loc[] and .iloc[] methods|
|rename()|Method is called on a DataFrame to change the names of the index labels or column names|
|columns()|	Method is an alternative attribute to change the coloumn name|
|drop()|Method is used to delete rows or columns from a DataFrame|
|pop()|Method is used to delete rows or columns from a DataFrame|
|sample()|Method pulls out a random sample of rows or columns from a DataFrame|
|nsmallest()|Method pulls out the rows with the smallest values in a column|
|nlargest()|Method pulls out the rows with the largest values in a column|
|shape()|Method returns a tuple representing the dimensionality of the DataFrame|
|ndim()|Method returns an ‘int’ representing the number of axes / array dimensions.Returns 1 if Series, otherwise returns 2 if DataFrame|
|dropna()|Method allows the user to analyze and drop Rows/Columns with Null values in different ways|
|fillna()|Method manages and let the user replace NaN values with some value of their own|
|rank()|Values in a Series can be ranked in order with this method|
|query()|Method is an alternate string-based syntax for extracting a subset from a DataFrame|
|copy()|Method creates an independent copy of a pandas object|
|duplicated()|Method creates a Boolean Series and uses it to extract rows that have duplicate values|
|drop_duplicates()|Method is an alternative option to identifying duplicate rows and removing them through filtering|
|set_index()|Method sets the DataFrame index (row labels) using one or more existing columns|
|reset_index()|Method resets index of a Data Frame. This method sets a list of integer ranging from 0 to length of data as index|
|where()|Method is used to check a Data Frame for one or more condition and return the result accordingly. By default, the rows not satisfying the condition are filled with NaN value|